agutierrezr.emmet-keybindings
anthropic.claude-code
bierner.github-markdown-preview
bierner.markdown-checkbox
bierner.markdown-emoji
bierner.markdown-footnotes
bierner.markdown-mermaid
bierner.markdown-preview-github-styles
bierner.markdown-yaml-preamble
canadaduane.vscode-kmonad
charliermarsh.ruff
codezombiech.gitignore
davidanson.vscode-markdownlint
docker.docker
eamodio.gitlens
ecmel.vscode-html-css
editorconfig.editorconfig
github.copilot-chat
github.vscode-github-actions
github.vscode-pull-request-github
kawamataryo.copy-python-dotted-path
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode.cmake-tools
ms-vscode.cpp-devtools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.vscode-speech
prateekmahendrakar.prettyxml
shd101wyy.markdown-preview-enhanced
shopify.theme-check-vscode
syler.sass-indented
tamasfe.even-better-toml
vscodevim.vim
xabikos.javascriptsnippets
xaver.clang-format
ziyasal.vscode-open-in-github
